# This file is generated by Anlogic Timing Wizard. 26 07 2022

#Created Clock
create_clock -name phy0_rxc -period 100 -waveform {0 50} [get_ports {PHY_RXC[0]}]
create_clock -name phy1_rxc -period 100 -waveform {0 50} [get_ports {PHY_RXC[1]}]
create_clock -name phy2_rxc -period 100 -waveform {0 50} [get_ports {PHY_RXC[2]}]
create_clock -name phy3_rxc -period 100 -waveform {0 50} [get_ports {PHY_RXC[3]}]
create_clock -name phy0_txc -period 100 -waveform {0 50} [get_ports {PHY_TXC[0]}]
create_clock -name phy1_txc -period 100 -waveform {0 50} [get_ports {PHY_TXC[1]}]
create_clock -name phy2_txc -period 100 -waveform {0 50} [get_ports {PHY_TXC[2]}]
create_clock -name phy3_txc -period 100 -waveform {0 50} [get_ports {PHY_TXC[3]}]
create_clock -name clk_in -period 41.667 -waveform {0 20.8335} [get_ports {CLK_IN}]

#Derive PLL Clocks
derive_pll_clocks -gen_basic_clock

#Set Input/Output Delay
set_input_delay -clock phy0_rxc -min 40 [get_ports {PHY_RXD[0]}]
set_input_delay -clock phy1_rxc -min 40 [get_ports {PHY_RXD[1]}]
set_input_delay -clock phy2_rxc -min 40 [get_ports {PHY_RXD[2]}]
set_input_delay -clock phy3_rxc -min 40 [get_ports {PHY_RXD[3]}]
set_input_delay -clock phy0_rxc -max 60 [get_ports {PHY_RXD[0]}]
set_input_delay -clock phy1_rxc -max 60 [get_ports {PHY_RXD[1]}]
set_input_delay -clock phy2_rxc -max 60 [get_ports {PHY_RXD[2]}]
set_input_delay -clock phy3_rxc -max 60 [get_ports {PHY_RXD[3]}]

set_output_delay -clock phy0_txc -min 10 [get_ports {PHY_TXD[0]}]
set_output_delay -clock phy1_txc -min 10 [get_ports {PHY_TXD[1]}]
set_output_delay -clock phy2_txc -min 10 [get_ports {PHY_TXD[2]}]
set_output_delay -clock phy3_txc -min 10 [get_ports {PHY_TXD[3]}]
set_output_delay -clock phy0_txc -max 20 [get_ports {PHY_TXD[0]}]
set_output_delay -clock phy1_txc -max 20 [get_ports {PHY_TXD[1]}]
set_output_delay -clock phy2_txc -max 20 [get_ports {PHY_TXD[2]}]
set_output_delay -clock phy3_txc -max 20 [get_ports {PHY_TXD[3]}]

#Set Clock Groups
set_clock_groups -asynchronous -group [get_clocks {clk_in}] -group [get_clocks {phy0_rxc}] -group [get_clocks {phy0_txc}] -group [get_clocks {phy1_txc}] -group [get_clocks {phy1_rxc}] -group [get_clocks {phy2_rxc}] -group [get_clocks {phy2_txc}] -group [get_clocks {phy3_rxc}] -group [get_clocks {phy3_txc}]

